FL0WL0W/EmbeddedIOServices/HardwareAbstractions/Stm32duino/src/Stm32duinoTimer.cpp
		//set mode
		TIM_HandleStruct.Instance = TimIndexToTIM(index);
		TIM_HandleStruct.Init.CounterMode = TIM_COUNTERMODE_UP;
		TIM_HandleStruct.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  		TIM_HandleStruct.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
		TIM_HandleStruct.Init.Prescaler = prescaler;
  		TIM_HandleStruct.Init.Period = period; // autoreload at max
		
		//init
		HAL_TIM_Base_Init(&TIM_HandleStruct);

		//configure clock
		TIM_ClockConfigTypeDef TIM_ClockConfigStruct = {0};
		TIM_ClockConfigStruct.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
		HAL_TIM_ConfigClockSource(&TIM_HandleStruct, &TIM_ClockConfigStruct);

		//start timer
		HAL_TIM_Base_Start(&TIM_HandleStruct);
	}

	TIM_TypeDef *TimIndexToTIM(TimerIndex index)
	{
		switch (index)
		{
#ifdef TIM1_BASE
		case TimerIndex::Index1:
			return TIM1;
#endif
#ifdef TIM2_BASE
		case TimerIndex::Index2:
			return TIM2;
#endif
#ifdef TIM3_BASE
		case TimerIndex::Index3:
			return TIM3;
#endif
#ifdef TIM4_BASE
		case TimerIndex::Index4:
			return TIM4;
#endif
#ifdef TIM5_BASE
		case TimerIndex::Index5:
			return TIM5;
#endif
#ifdef TIM6_BASE
		case TimerIndex::Index6:
			return TIM6;
#endif
#ifdef TIM7_BASE
		case TimerIndex::Index7:
			return TIM7;
#endif
#ifdef TIM8_BASE
		case TimerIndex::Index8:
			return TIM8;
#endif
#ifdef TIM9_BASE
		case TimerIndex::Index9:
			return TIM9;
#endif
#ifdef TIM10_BASE
		case TimerIndex::Index10:
			return TIM10;
#endif
#ifdef TIM11_BASE
		case TimerIndex::Index11:
			return TIM11;
#endif
#ifdef TIM12_BASE
		case TimerIndex::Index12:
			return TIM12;
#endif
#ifdef TIM13_BASE
		case TimerIndex::Index13:
			return TIM13;
#endif
#ifdef TIM14_BASE
		case TimerIndex::Index14:
			return TIM14;
#endif
#ifdef TIM15_BASE
		case TimerIndex::Index15:
			return TIM15;
#endif
#ifdef TIM16_BASE
		case TimerIndex::Index16:
			return TIM16;
#endif
#ifdef TIM17_BASE
		case TimerIndex::Index17:
			return TIM17;
#endif
#ifdef TIM18_BASE
		case TimerIndex::Index18:
			return TIM18;
#endif
#ifdef TIM19_BASE
		case TimerIndex::Index19:
			return TIM19;
#endif
#ifdef TIM20_BASE
		case TimerIndex::Index20:
			return TIM20;
#endif
#ifdef TIM21_BASE
		case TimerIndex::Index21:
			return TIM21;
#endif
#ifdef TIM22_BASE
		case TimerIndex::Index22:
			return TIM22;
#endif
		}
	}

    void EnableTimerInterrupts(TimerIndex index)
	{
		if(_hardwareTimer[index] == 0)
			_hardwareTimer[index] = new HardwareTimer(TimIndexToTIM(index));

		switch (index)
		{
#ifdef TIM1_BASE
		case TimerIndex::Index1:
			_hardwareTimer[TimerIndex::Index1]->attachInterrupt(1, TIM1_CC1);
			_hardwareTimer[TimerIndex::Index1]->attachInterrupt(2, TIM1_CC2);
			_hardwareTimer[TimerIndex::Index1]->attachInterrupt(3, TIM1_CC3);
			_hardwareTimer[TimerIndex::Index1]->attachInterrupt(4, TIM1_CC4);
			break;
#endif
#ifdef TIM2_BASE
		case TimerIndex::Index2:
			_hardwareTimer[TimerIndex::Index2]->attachInterrupt(1, TIM2_CC1);
			_hardwareTimer[TimerIndex::Index2]->attachInterrupt(2, TIM2_CC2);
			_hardwareTimer[TimerIndex::Index2]->attachInterrupt(3, TIM2_CC3);
			_hardwareTimer[TimerIndex::Index2]->attachInterrupt(4, TIM2_CC4);
			break;
#endif
#ifdef TIM3_BASE
		case TimerIndex::Index3:
			_hardwareTimer[TimerIndex::Index3]->attachInterrupt(1, TIM3_CC1);
			_hardwareTimer[TimerIndex::Index3]->attachInterrupt(2, TIM3_CC2);
			_hardwareTimer[TimerIndex::Index3]->attachInterrupt(3, TIM3_CC3);
			_hardwareTimer[TimerIndex::Index3]->attachInterrupt(4, TIM3_CC4);
			break;
#endif
#ifdef TIM4_BASE
		case TimerIndex::Index4:
			_hardwareTimer[TimerIndex::Index4]->attachInterrupt(1, TIM4_CC1);
			_hardwareTimer[TimerIndex::Index4]->attachInterrupt(2, TIM4_CC2);
			_hardwareTimer[TimerIndex::Index4]->attachInterrupt(3, TIM4_CC3);
			_hardwareTimer[TimerIndex::Index4]->attachInterrupt(4, TIM4_CC4);
			break;
#endif
#ifdef TIM5_BASE
		case TimerIndex::Index5:
			_hardwareTimer[TimerIndex::Index5]->attachInterrupt(1, TIM5_CC1);
			_hardwareTimer[TimerIndex::Index5]->attachInterrupt(2, TIM5_CC2);
			_hardwareTimer[TimerIndex::Index5]->attachInterrupt(3, TIM5_CC3);
			_hardwareTimer[TimerIndex::Index5]->attachInterrupt(4, TIM5_CC4);
			break;
#endif
#ifdef TIM6_BASE
		case TimerIndex::Index6:
			_hardwareTimer[TimerIndex::Index6]->attachInterrupt(1, TIM6_CC1);
			_hardwareTimer[TimerIndex::Index6]->attachInterrupt(2, TIM6_CC2);
			_hardwareTimer[TimerIndex::Index6]->attachInterrupt(3, TIM6_CC3);
			_hardwareTimer[TimerIndex::Index6]->attachInterrupt(4, TIM6_CC4);
			break;
#endif
#ifdef TIM7_BASE
		case TimerIndex::Index7:
			_hardwareTimer[TimerIndex::Index7]->attachInterrupt(1, TIM7_CC1);
			_hardwareTimer[TimerIndex::Index7]->attachInterrupt(2, TIM7_CC2);
			_hardwareTimer[TimerIndex::Index7]->attachInterrupt(3, TIM7_CC3);
			_hardwareTimer[TimerIndex::Index7]->attachInterrupt(4, TIM7_CC4);
			break;
#endif
#ifdef TIM8_BASE
		case TimerIndex::Index8:
			_hardwareTimer[TimerIndex::Index8]->attachInterrupt(1, TIM8_CC1);
			_hardwareTimer[TimerIndex::Index8]->attachInterrupt(2, TIM8_CC2);
			_hardwareTimer[TimerIndex::Index8]->attachInterrupt(3, TIM8_CC3);
			_hardwareTimer[TimerIndex::Index8]->attachInterrupt(4, TIM8_CC4);
			break;
#endif
#ifdef TIM9_BASE
		case TimerIndex::Index9:
			_hardwareTimer[TimerIndex::Index9]->attachInterrupt(1, TIM9_CC1);
			_hardwareTimer[TimerIndex::Index9]->attachInterrupt(2, TIM9_CC2);
			_hardwareTimer[TimerIndex::Index9]->attachInterrupt(3, TIM9_CC3);
			_hardwareTimer[TimerIndex::Index9]->attachInterrupt(4, TIM9_CC4);
			break;
#endif
#ifdef TIM10_BASE
		case TimerIndex::Index10:
			_hardwareTimer[TimerIndex::Index10]->attachInterrupt(1, TIM10_CC1);
			_hardwareTimer[TimerIndex::Index10]->attachInterrupt(2, TIM10_CC2);
			_hardwareTimer[TimerIndex::Index10]->attachInterrupt(3, TIM10_CC3);
			_hardwareTimer[TimerIndex::Index10]->attachInterrupt(4, TIM10_CC4);
			break;
#endif
#ifdef TIM11_BASE
		case TimerIndex::Index11:
			_hardwareTimer[TimerIndex::Index11]->attachInterrupt(1, TIM11_CC1);
			_hardwareTimer[TimerIndex::Index11]->attachInterrupt(2, TIM11_CC2);
			_hardwareTimer[TimerIndex::Index11]->attachInterrupt(3, TIM11_CC3);
			_hardwareTimer[TimerIndex::Index11]->attachInterrupt(4, TIM11_CC4);
			break;
#endif
#ifdef TIM12_BASE
		case TimerIndex::Index12:
			_hardwareTimer[TimerIndex::Index12]->attachInterrupt(1, TIM12_CC1);
			_hardwareTimer[TimerIndex::Index12]->attachInterrupt(2, TIM12_CC2);
			_hardwareTimer[TimerIndex::Index12]->attachInterrupt(3, TIM12_CC3);
			_hardwareTimer[TimerIndex::Index12]->attachInterrupt(4, TIM12_CC4);
			break;
#endif
#ifdef TIM13_BASE
		case TimerIndex::Index13:
			_hardwareTimer[TimerIndex::Index13]->attachInterrupt(1, TIM13_CC1);
			_hardwareTimer[TimerIndex::Index13]->attachInterrupt(2, TIM13_CC2);
			_hardwareTimer[TimerIndex::Index13]->attachInterrupt(3, TIM13_CC3);
			_hardwareTimer[TimerIndex::Index13]->attachInterrupt(4, TIM13_CC4);
			break;
#endif
#ifdef TIM14_BASE
		case TimerIndex::Index14:
			_hardwareTimer[TimerIndex::Index14]->attachInterrupt(1, TIM14_CC1);
			_hardwareTimer[TimerIndex::Index14]->attachInterrupt(2, TIM14_CC2);
			_hardwareTimer[TimerIndex::Index14]->attachInterrupt(3, TIM14_CC3);
			_hardwareTimer[TimerIndex::Index14]->attachInterrupt(4, TIM14_CC4);
			break;
#endif
#ifdef TIM15_BASE
		case TimerIndex::Index15:
			_hardwareTimer[TimerIndex::Index15]->attachInterrupt(1, TIM15_CC1);
			_hardwareTimer[TimerIndex::Index15]->attachInterrupt(2, TIM15_CC2);
			_hardwareTimer[TimerIndex::Index15]->attachInterrupt(3, TIM15_CC3);
			_hardwareTimer[TimerIndex::Index15]->attachInterrupt(4, TIM15_CC4);
			break;
#endif
#ifdef TIM16_BASE
		case TimerIndex::Index16:
			_hardwareTimer[TimerIndex::Index16]->attachInterrupt(1, TIM16_CC1);
			_hardwareTimer[TimerIndex::Index16]->attachInterrupt(2, TIM16_CC2);
			_hardwareTimer[TimerIndex::Index16]->attachInterrupt(3, TIM16_CC3);
			_hardwareTimer[TimerIndex::Index16]->attachInterrupt(4, TIM16_CC4);
			break;
#endif
#ifdef TIM17_BASE
		case TimerIndex::Index17:
			_hardwareTimer[TimerIndex::Index17]->attachInterrupt(1, TIM17_CC1);
			_hardwareTimer[TimerIndex::Index17]->attachInterrupt(2, TIM17_CC2);
			_hardwareTimer[TimerIndex::Index17]->attachInterrupt(3, TIM17_CC3);
			_hardwareTimer[TimerIndex::Index17]->attachInterrupt(4, TIM17_CC4);
			break;
#endif
#ifdef TIM18_BASE
		case TimerIndex::Index18:
			_hardwareTimer[TimerIndex::Index18]->attachInterrupt(1, TIM18_CC1);
			_hardwareTimer[TimerIndex::Index18]->attachInterrupt(2, TIM18_CC2);
			_hardwareTimer[TimerIndex::Index18]->attachInterrupt(3, TIM18_CC3);
			_hardwareTimer[TimerIndex::Index18]->attachInterrupt(4, TIM18_CC4);
			break;
#endif
#ifdef TIM19_BASE
		case TimerIndex::Index19:
			_hardwareTimer[TimerIndex::Index19]->attachInterrupt(1, TIM19_CC1);
			_hardwareTimer[TimerIndex::Index19]->attachInterrupt(2, TIM19_CC2);
			_hardwareTimer[TimerIndex::Index19]->attachInterrupt(3, TIM19_CC3);
			_hardwareTimer[TimerIndex::Index19]->attachInterrupt(4, TIM19_CC4);
			break;
#endif
#ifdef TIM20_BASE
		case TimerIndex::Index20:
			_hardwareTimer[TimerIndex::Index20]->attachInterrupt(1, TIM20_CC1);
			_hardwareTimer[TimerIndex::Index20]->attachInterrupt(2, TIM20_CC2);
			_hardwareTimer[TimerIndex::Index20]->attachInterrupt(3, TIM20_CC3);
			_hardwareTimer[TimerIndex::Index20]->attachInterrupt(4, TIM20_CC4);
			break;
#endif
#ifdef TIM21_BASE
		case TimerIndex::Index21:
			_hardwareTimer[TimerIndex::Index21]->attachInterrupt(1, TIM21_CC1);
			_hardwareTimer[TimerIndex::Index21]->attachInterrupt(2, TIM21_CC2);
			_hardwareTimer[TimerIndex::Index21]->attachInterrupt(3, TIM21_CC3);
			_hardwareTimer[TimerIndex::Index21]->attachInterrupt(4, TIM21_CC4);
			break;
#endif
#ifdef TIM22_BASE
		case TimerIndex::Index22:
			_hardwareTimer[TimerIndex::Index22]->attachInterrupt(1, TIM22_CC1);
			_hardwareTimer[TimerIndex::Index22]->attachInterrupt(2, TIM22_CC2);
			_hardwareTimer[TimerIndex::Index22]->attachInterrupt(3, TIM22_CC3);
			_hardwareTimer[TimerIndex::Index22]->attachInterrupt(4, TIM22_CC4);
			break;
#endif
		}
	}
}
